UCB_CS61_lec22.org
# -*- org-export-babel-evaluate: nil -*-
#+PROPERTY: header-args :eval never-export
#+PROPERTY: header-args:python :session 第二十二课 Dictionay-2, Hash Table
#+PROPERTY: header-args:ipython :session 第二十二课 Dictionay-2, Hash Table
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
#+HTML_HEAD: <script src="https://hypothes.is/embed.js" async></script>
#+HTML_HEAD: <script type="application/json" class="js-hypothesis-config">
#+HTML_HEAD: <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
#+OPTIONS: html-link-use-abs-url:nil html-postamble:nil html-preamble:t
#+OPTIONS: H:3 num:t ^:nil _:nil tags:not-in-toc
#+TITLE: 第二十二课 Dictionay-2, Hash Table
#+AUTHOR: yiddishkop
#+EMAIL: [[mailto:yiddishkop@163.com][yiddi's email]]
#+TAGS: {PKGIMPT(i) DATAVIEW(v) DATAPREP(p) GRAPHBUILD(b) GRAPHCOMPT(c)} LINAGAPI(a) PROBAPI(b) MATHFORM(f) MLALGO(m)


* DICTIONARIES (continued)

** Hash Codes
Since hash codes often need to be designed specially for each new object, you're
left to your own wits. Here is an example of a good hash code for Strings.
#+BEGIN_SRC java
  private static int hashCode(String key) {
    int hashVal = 0;
    for (int i = 0; i < key.length(); i++) {
      hashVal = (127 * hashVal + key.charAt(i)) % 16908799;
    }
    return hashVal;
  }
#+END_SRC

By multiplying the hash code by 127 before adding in each new character, we make
sure that each character has a different effect on the final result. The "%"
operator with a prime number tends to "mix up the bits" of the hash code. The
prime is chosen to be large, but not so large that 127 * hashVal + key.charAt(i)
will ever exceed the maximum possible value of an int.

The best way to understand good hash codes is to understand why bad hash codes
are bad.  Here are some examples of bad hash codes on Words.

  1)  Sum up the ASCII values of the characters. Unfortunately, the sum will
     rarely exceed 500 or so, and most of the entries will be bunched up in a
     few hundred buckets. Moreover, anagrams like "pat," "tap," and "apt" will
     collide.
  2)  Use the first three letters of a word, in a table with 26^3 buckets.
     Unfortunately, words beginning with "pre" are much more common than words
     beginning with "xzq", and the former will be bunched up in one long list.
     This does not approach our uniformly distributed ideal.
  3)  Consider the "good" hashCode() function written out above. Suppose the
     prime modulus is 127 instead of 16908799. Then the return value is just the
     last character of the word, because ~(127 * hashVal) % 127 = 0~. That's why
     127 and 16908799 were chosen to have no common factors.

*Why is the ~hashCode()~ function presented above good?*  Because we can find no
obvious flaws, and it seems to work well in practice.  (A black art indeed.)


总结起来，散列
1. 模取余，可以让太大的数字减小；
2. 模的大小决定了散布的范围；所以模一定要大一些；
3. 若数<<模，模了之后没有变化，还是原来的数；
4. 若模<<数，模了之后，所有数字都会挤在一起；
5. 所以数和模都要同时大。



** Resizing Hash Tables
   Sometimes we can't predict in advance how many entries we'll need to store. If
the load factor n/N (entries per bucket) gets too large, we are in danger of
losing constant-time performance.

One option is to enlarge the hash table when the load factor becomes too large
(typically larger than 0.75). Allocate a new array (typically at least twice as
long as the old), then walk through all the entries in the old array and
_rehash_ them into the new.

Take note:  you CANNOT just copy the linked lists to the same buckets in the
new array, because the compression functions of the two arrays will certainly
be incompatible.  You have to rehash each entry individually.

You can also shrink hash tables (e.g., when n/N < 0.25) to free memory, if you
think the memory will benefit something else. (In practice, it's only sometimes
worth the effort.)

Obviously, an operation that causes a hash table to resize itself takes more
than O(1) time; nevertheless, the _average_ over the long run is still O(1) time
per operation.

** Transposition Tables:  Using a Dictionary to Speed Game Trees
An inefficiency of unadorned game tree search is that some grids can be reached
through many different sequences of moves, and so the same grid might be
evaluated many times. To reduce this expense, maintain a hash table that records
previously encountered grids. This dictionary is called a _transposition_table_.
Each time you compute a grid's score, insert into the dictionary an entry whose
key is the grid and whose value is the grid's score. Each time the minimax
algorithm considers a grid, it should first check whether the grid is in the
transposition table; if so, its score is returned immediately. Otherwise, its
score is evaluated recursively and stored in the transposition table.

Transposition tables will only help you with your project if you can search to
a depth of at least three ply (within the five second time limit).  It takes
three ply to reach the same grid two different ways.

After each move is taken, the transposition table should be emptied, because
you will want to search grids to a greater depth than you did during the
previous move.

