UCB_CS61_lec22.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-09 四 23:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>第二十二课 Dictionay-2, Hash Table</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yiddishkop" />
<link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
</head>
<body>
<div id="content">
<h1 class="title">第二十二课 Dictionay-2, Hash Table</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org21d109a">DICTIONARIES (continued)</a>
<ul>
<li><a href="#org4296f3a">Hash Codes</a></li>
<li><a href="#org256f23f">Resizing Hash Tables</a></li>
<li><a href="#org2765b03">Transposition Tables:  Using a Dictionary to Speed Game Trees</a></li>
</ul>
</li>
<li><a href="#orge7eb195">STACKS</a>
<ul>
<li><a href="#org61cad96">Expression Parsing</a>
<ul>
<li><a href="#org712a473">Evaluated by a stack of numbers</a></li>
<li><a href="#orgba14a75">Converting Infix to Postfix</a></li>
<li><a href="#orgafb98a6">Why does this work</a></li>
<li><a href="#org0974a74">Example of infix</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9c301a8">QUEUES</a></li>
<li><a href="#org68fa667">DEQUES</a>
<ul>
<li><a href="#orgd7abd84">Postscript:  A Faster Hash Code (not examinable)</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="org21d109a" class="outline-2">
<h2 id="org21d109a">DICTIONARIES (continued)</h2>
<div class="outline-text-2" id="text-org21d109a">
</div>
<div id="org4296f3a" class="outline-3">
<h3 id="org4296f3a">Hash Codes</h3>
<div class="outline-text-3" id="text-org4296f3a">
<p>
Since hash codes often need to be designed specially for each new object, you're
left to your own wits. Here is an example of a good hash code for Strings.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">hashCode</span>(<span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">key</span>) {
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">hashVal</span> = <span style="color: #a45bad;">0</span>;
  <span style="color: #4f97d7; font-weight: bold;">for</span> (<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = <span style="color: #a45bad;">0</span>; i &lt; key.<span style="color: #ce537a; font-weight: bold;">length</span>(); i++) {
    hashVal = (<span style="color: #a45bad;">127</span> * hashVal + key.charAt(i)) % <span style="color: #a45bad;">16908799</span>;
  }
  <span style="color: #4f97d7; font-weight: bold;">return</span> hashVal;
}
</pre>
</div>

<p>
By multiplying the hash code by 127 before adding in each new character, we make
sure that each character has a different effect on the final result. The "%"
operator with a prime number tends to "mix up the bits" of the hash code. The
prime is chosen to be large, but not so large that 127 * hashVal + key.charAt(i)
will ever exceed the maximum possible value of an int.
</p>

<p>
The best way to understand good hash codes is to understand why bad hash codes
are bad.  Here are some examples of bad hash codes on Words.
</p>

<ol class="org-ol">
<li>Sum up the ASCII values of the characters. Unfortunately, the sum will
rarely exceed 500 or so, and most of the entries will be bunched up in a
few hundred buckets. Moreover, anagrams like "pat," "tap," and "apt" will
collide.</li>
<li>Use the first three letters of a word, in a table with 26^3 buckets.
Unfortunately, words beginning with "pre" are much more common than words
beginning with "xzq", and the former will be bunched up in one long list.
This does not approach our uniformly distributed ideal.</li>
<li>Consider the "good" hashCode() function written out above. Suppose the
prime modulus is 127 instead of 16908799. Then the return value is just the
last character of the word, because <code>(127 * hashVal) % 127 = 0</code>. That's why
127 and 16908799 were chosen to have no common factors.</li>
</ol>

<p>
<b>Why is the <code>hashCode()</code> function presented above good?</b>  Because we can find no
obvious flaws, and it seems to work well in practice.  (A black art indeed.)
</p>
</div>
</div>

<div id="org256f23f" class="outline-3">
<h3 id="org256f23f">Resizing Hash Tables</h3>
<div class="outline-text-3" id="text-org256f23f">
<p>
   Sometimes we can't predict in advance how many entries we'll need to store. If
the load factor n/N (entries per bucket) gets too large, we are in danger of
losing constant-time performance.
</p>

<p>
One option is to enlarge the hash table when the load factor becomes too large
(typically larger than 0.75). Allocate a new array (typically at least twice as
long as the old), then walk through all the entries in the old array and
<span class="underline">rehash</span> them into the new.
</p>

<p>
Take note:  you CANNOT just copy the linked lists to the same buckets in the
new array, because the compression functions of the two arrays will certainly
be incompatible.  You have to rehash each entry individually.
</p>

<p>
You can also shrink hash tables (e.g., when n/N &lt; 0.25) to free memory, if you
think the memory will benefit something else. (In practice, it's only sometimes
worth the effort.)
</p>

<p>
Obviously, an operation that causes a hash table to resize itself takes more
than O(1) time; nevertheless, the <span class="underline">average</span> over the long run is still O(1) time
per operation.
</p>
</div>
</div>

<div id="org2765b03" class="outline-3">
<h3 id="org2765b03">Transposition Tables:  Using a Dictionary to Speed Game Trees</h3>
<div class="outline-text-3" id="text-org2765b03">
<p>
An inefficiency of unadorned game tree search is that some grids can be reached
through many different sequences of moves, and so the same grid might be
evaluated many times. To reduce this expense, maintain a hash table that records
previously encountered grids. This dictionary is called a <span class="underline">transposition_table</span>.
Each time you compute a grid's score, insert into the dictionary an entry whose
key is the grid and whose value is the grid's score. Each time the minimax
algorithm considers a grid, it should first check whether the grid is in the
transposition table; if so, its score is returned immediately. Otherwise, its
score is evaluated recursively and stored in the transposition table.
</p>

<p>
Transposition tables will only help you with your project if you can search to
a depth of at least three ply (within the five second time limit).  It takes
three ply to reach the same grid two different ways.
</p>

<p>
After each move is taken, the transposition table should be emptied, because
you will want to search grids to a greater depth than you did during the
previous move.
</p>
</div>
</div>
</div>
