UCB_CS61_lec22.org
* STACKS
A _stack_ is a crippled list.  You may manipulate only the item at the top of
the stack.  The main operations: you may "push" a new item onto the top of the
stack; you may "pop" the top item off the stack; you may examine the "top" item
of the stack.  A stack can grow arbitrarily large.

#+BEGIN_EXAMPLE
 | |          | |            | | -size()-> 2 |d| -top()-> d     | |
 |b| -pop()-> | | -push(c)-> |c|             |c|                | | -top()--
 |a|    |     |a|            |a| -push(d)--> |a| --pop() x 3--> | |        |
 ---    v     ---            ---             ---                ---        v
        b                                                                 null
#+END_EXAMPLE

#+BEGIN_SRC java
public interface Stack {
  public int size();
  public boolean isEmpty();
  public void push(Object item);
  public Object pop();
  public Object top();
}
#+END_SRC

In any reasonable implementation, all these methods run in O(1) time. A stack is
easily implemented as a singly-linked list, using just the ~front()~,
~insertFront()~, and ~removeFront()~ methods.

Why talk about Stacks when we already have Lists?  Mainly so you can carry on
discussions with other computer programmers.  If somebody tells you that
an algorithm uses a stack, the limitations of a stack give you a hint how
the algorithm works.

Sample application: *Verifying matched parentheses* in a String like
"~{[(){[]}]()}~". Scan through the String, character by character.
  -  When you encounter a lefty--'{', '[', or '('--push it onto the stack.
  -  When you encounter a righty, pop its counterpart from atop the stack, and
     check that they match.
If there's a mismatch or null returned, or if the stack is not empty when you
reach the end of the string, the parentheses are not properly matched.
** Expression Parsing

   - Infix  : 3 + 4 * 7
   - Prefix : + 3 * 4 7 (scheme)
   - Postfix: 3 4 7 * +

   *postfix* write operator after its operands, each operand can be postfix
    expression
    #+BEGIN_EXAMPLE
1  2  +  3  4  +  *  =  3  7  *  =  21
--^----  -----^-
  |           |
  +--operand--+

    #+END_EXAMPLE
*** Evaluated by a stack of numbers
     #+NAME: ParsePostfix
     #+BEGIN_QUOTE
     1. Read expression left to right
        1. Number: push it onto the stack.
        2. Operator: pop top 2 numbers of stack;
                     perfor operation(first number popped as second operand));
                     push result on stack
     #+END_QUOTE

     #+NAME: ParsePostfix
     #+BEGIN_SRC java
public static void operate(Stack numStack, char operator)
    throws StackEmptyException{
    int operand2 = ((Integer) numStackpop()).intValue();
    int operand1 = ((Integer) numStackpop()).intValue();
    System.out.print(operator + " ");

    switch(operator){
    case '+':
        numStack.push(new Integer(operand1 + operand2));
        break;
    case '-':
        numStack.push(new Integer(operand1 - operand2));
        break;
    case '*':
        numStack.push(new Integer(operand1 * operand2));
        break;
    case '/':
        numStack.push(new Integer(operand1 / operand2));
        break;
    }

}

// Reads a postfix expr, evaluated & prints it.
// java ParsePostfix '73*2+'
// output: 7 3 * 2 +  result: 23
public static void main(String[] args)
    throws StackEmptyException{
    LinkedStack numStack = new LinkedStack();

    for(int i = 0; i < args[0].length(); i++){
        char c = args[0].charAt(i);
        if(Character.isDigit(c)){                                       // if Digit?
            System.out.print(c + " ");                                  // push
            numStack.push(new Integer(Character.digit(c, 36)))              //
        }else if((c == '+') || (c == '-')|| (c == '*')||(c == '/')){    // else
            operate(numStack, c);                                       // operate
        }
    }
}
     #+END_SRC

     #+NAME: stackOfParse
     #+BEGIN_SRC ditaa
|    |    |    |    |    |    |    |    |    |    |    |
|    |    |    |    |    |    | 5  |    |    |    |    |
|    |--->|    |--->| 7  |--->| 7  |--->| 2  |--->|    |
|    | 2  | 2  | 7  | 2  | 5  | 2  | -  | 2  | *  | 4  |
+----+    +----+    +----+    +----+    +----+    +----+

    |    |    |    |    |    |    |    |
    |    |    | 5  |    |    |    |    |
--->| 8  |--->| 8  |--->| 3  |--->|    |
 8  | 4  | 5  | 4  | -  | 4  | *  | 12 |
    +----+    +----+    +----+    +----+
     #+END_SRC
