UCB_CS61_lec22.html

<div id="orge7eb195" class="outline-2">
<h2 id="orge7eb195">STACKS</h2>
<div class="outline-text-2" id="text-orge7eb195">
<p>
A <span class="underline">stack</span> is a crippled list.  You may manipulate only the item at the top of
the stack.  The main operations: you may "push" a new item onto the top of the
stack; you may "pop" the top item off the stack; you may examine the "top" item
of the stack.  A stack can grow arbitrarily large.
</p>

<pre class="example">
| |          | |            | | -size()-&gt; 2 |d| -top()-&gt; d     | |
|b| -pop()-&gt; | | -push(c)-&gt; |c|             |c|                | | -top()--
|a|    |     |a|            |a| -push(d)--&gt; |a| --pop() x 3--&gt; | |        |
---    v     ---            ---             ---                ---        v
       b                                                                 null
</pre>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">interface</span> <span style="color: #ce537a; font-weight: bold;">Stack</span> {
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">size</span>();
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">boolean</span> <span style="color: #bc6ec5; font-weight: bold;">isEmpty</span>();
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">push</span>(<span style="color: #ce537a; font-weight: bold;">Object</span> <span style="color: #7590db;">item</span>);
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">Object</span> <span style="color: #bc6ec5; font-weight: bold;">pop</span>();
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">Object</span> <span style="color: #bc6ec5; font-weight: bold;">top</span>();
}
</pre>
</div>

<p>
In any reasonable implementation, all these methods run in O(1) time. A stack is
easily implemented as a singly-linked list, using just the <code>front()</code>,
<code>insertFront()</code>, and <code>removeFront()</code> methods.
</p>

<p>
Why talk about Stacks when we already have Lists?  Mainly so you can carry on
discussions with other computer programmers.  If somebody tells you that
an algorithm uses a stack, the limitations of a stack give you a hint how
the algorithm works.
</p>

<p>
Sample application: <b>Verifying matched parentheses</b> in a String like
"<code>{[(){[]}]()}</code>". Scan through the String, character by character.
</p>
<ul class="org-ul">
<li>When you encounter a lefty&#x2013;'{', '[', or '('&#x2013;push it onto the stack.</li>
<li>When you encounter a righty, pop its counterpart from atop the stack, and
check that they match.</li>
</ul>
<p>
If there's a mismatch or null returned, or if the stack is not empty when you
reach the end of the string, the parentheses are not properly matched.
</p>
</div>
<div id="org61cad96" class="outline-3">
<h3 id="org61cad96">Expression Parsing</h3>
<div class="outline-text-3" id="text-org61cad96">
<ul class="org-ul">
<li>Infix  : 3 + 4 * 7</li>
<li>Prefix : + 3 * 4 7 (scheme)</li>
<li>Postfix: 3 4 7 * +</li>
</ul>

<p>
<b>postfix</b> write operator after its operands, each operand can be postfix
 expression
</p>
<pre class="example">
1  2  +  3  4  +  *  =  3  7  *  =  21
--^----  -----^-
  |           |
  +--operand--+

</pre>
</div>
<div id="org712a473" class="outline-4">
<h4 id="org712a473">Evaluated by a stack of numbers</h4>
<div class="outline-text-4" id="text-org712a473">
<blockquote id="ParsePostfix">
<ol class="org-ol">
<li>Read expression left to right
<ol class="org-ol">
<li>Number: push it onto the stack.</li>
<li>Operator: pop top 2 numbers of stack;
perfor operation(first number popped as second operand));
push result on stack</li>
</ol></li>
</ol>
</blockquote>

<div class="org-src-container">
<pre class="src src-java" id="org81fc8de"><span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">operate</span>(<span style="color: #ce537a; font-weight: bold;">Stack</span> <span style="color: #7590db;">numStack</span>, <span style="color: #ce537a; font-weight: bold;">char</span> <span style="color: #7590db;">operator</span>)
    <span style="color: #4f97d7; font-weight: bold;">throws</span> <span style="color: #ce537a; font-weight: bold;">StackEmptyException</span>{
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">operand2</span> = ((<span style="color: #ce537a; font-weight: bold;">Integer</span>) numStackpop()).intValue();
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">operand1</span> = ((<span style="color: #ce537a; font-weight: bold;">Integer</span>) numStackpop()).intValue();
    System.out.print(operator + <span style="color: #2d9574;">" "</span>);

    <span style="color: #4f97d7; font-weight: bold;">switch</span>(operator){
    <span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #2d9574;">'+'</span>:
        numStack.push(<span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Integer</span>(operand1 + operand2));
        <span style="color: #4f97d7; font-weight: bold;">break</span>;
    <span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #2d9574;">'-'</span>:
        numStack.push(<span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Integer</span>(operand1 - operand2));
        <span style="color: #4f97d7; font-weight: bold;">break</span>;
    <span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #2d9574;">'*'</span>:
        numStack.push(<span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Integer</span>(operand1 * operand2));
        <span style="color: #4f97d7; font-weight: bold;">break</span>;
    <span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #2d9574;">'/'</span>:
        numStack.push(<span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Integer</span>(operand1 / operand2));
        <span style="color: #4f97d7; font-weight: bold;">break</span>;
    }

}

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Reads a postfix expr, evaluated &amp; prints it.</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">java ParsePostfix '73*2+'</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">output: 7 3 * 2 +  result: 23</span>
<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">String</span>[] <span style="color: #7590db;">args</span>)
    <span style="color: #4f97d7; font-weight: bold;">throws</span> <span style="color: #ce537a; font-weight: bold;">StackEmptyException</span>{
    <span style="color: #ce537a; font-weight: bold;">LinkedStack</span> <span style="color: #7590db;">numStack</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">LinkedStack</span>();

    <span style="color: #4f97d7; font-weight: bold;">for</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = <span style="color: #a45bad;">0</span>; i &lt; <span style="color: #ce537a; font-weight: bold;">args</span>[<span style="color: #a45bad;">0</span>].length(); i++){
        <span style="color: #ce537a; font-weight: bold;">char</span> <span style="color: #7590db;">c</span> = args[<span style="color: #a45bad;">0</span>].charAt(i);
        <span style="color: #4f97d7; font-weight: bold;">if</span>(Character.isDigit(c)){                                       <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">if Digit?</span>
            System.out.print(c + <span style="color: #2d9574;">" "</span>);                                  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">push</span>
            numStack.push(<span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Integer</span>(Character.digit(c, <span style="color: #a45bad;">36</span>)))              <span style="color: #2aa1ae; background-color: #292e34;">//</span>
        }<span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #4f97d7; font-weight: bold;">if</span>((c == <span style="color: #2d9574;">'+'</span>) || (c == <span style="color: #2d9574;">'-'</span>)|| (c == <span style="color: #2d9574;">'*'</span>)||(c == <span style="color: #2d9574;">'/'</span>)){    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">else</span>
            operate(numStack, c);                                       <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">operate</span>
        }
    }
}
</pre>
</div>
</div>
</div>
