UCB_CS61_lec22.html

<div id="orgba14a75" class="outline-4">
<h4 id="orgba14a75">Converting Infix to Postfix</h4>
<div class="outline-text-4" id="text-orgba14a75">
<pre class="example">
Precedence rules: Exponentiation(^) &gt;
                  multiply(*),divide(/) &gt;
                  add(+),subtract(-)

Associated rules: + - * / left-associative,  2-3-5 = (2-3)-5
                        ^ right-associative, 2^3^4 != 2^12; 2^3^4 = 2^81
</pre>

<pre class="example" id="ConverPostfix2Infix">
Read expr. left -&gt; right
 1. Number:      print it out.
 2. Operator:    put it on stack until an operator
                 with lower or equal precedence appears(for exponentiation, strictly lower), where upon we pop it &amp; print it.
 3. String ends: pop &amp; print each item on stack
</pre>
</div>
</div>

<div id="orgafb98a6" class="outline-4">
<h4 id="orgafb98a6">Why does this work</h4>
<div class="outline-text-4" id="text-orgafb98a6">
<pre class="example">
1. '3 * 2' ---&gt; "3 2 *"
2. Newest operator has lower precedence;
   1. "3 * 2 +" ---&gt; "3 2 *",
   2. push the "+" &amp; continue.
3. "3 * 2 ^" ---&gt; "3 2", |^| on stack.
                         |*|
                         ---
   "*" stays on stack until 2nd operand done
</pre>
</div>
</div>
<div id="org0974a74" class="outline-4">
<h4 id="org0974a74">Example of infix</h4>
<div class="outline-text-4" id="text-org0974a74">
<pre class="example" id="stackOfConvertInfix2PostFix">
infix "3*5+4^5^6

|    |    |    |    |    |    |    |    |    |    |    |
|    |    |    |    |    |    |    |    |    |    |    |
|    |---&gt;|    |---&gt;|    |---&gt;|    |---&gt;|    |---&gt;|    |
|    | 3  |    | *  | *  | 5  | *  | +  | +  | 4  | +  |
+----+    +----+    +----+    +----+    +----+    +----+
Output:3                   5         *         4

    |    |    |    |    |    |    |    |
    |    |    |    |    | ^  |    | ^  |    End, and
---&gt;| ^  |---&gt;| ^  |---&gt;| ^  |---&gt;| ^  |---&gt;pop all items
 ^  | +  | 5  | +  | ^  | +  | 6  | +  |    in stack
    +----+    +----+    +----+    +----+
Output:    5                   6            ^ ^ +

postfix: 3 5 * 4 5 6 ^ ^ +

</pre>
</div>
</div>
</div>
</div>

<div id="org9c301a8" class="outline-2">
<h2 id="org9c301a8">QUEUES</h2>
<div class="outline-text-2" id="text-org9c301a8">
<p>
A <span class="underline">queue</span> is also a crippled list.  You may read or remove only the item at the
front of the queue, and you may add an item only to the back of the queue.  The
main operations:  you may "enqueue" an item at the back of the queue; you may
"dequeue" the item at the front; you may examine the "front" item.  Don't be
fooled by the diagram; a queue can grow arbitrarily long.
</p>

<pre class="example">
===              ===               ===               === -front()-&gt; b
ab. -dequeue()-&gt; b.. -enqueue(c)-&gt; bc. -enqueue(d)-&gt; bcd
===     |        ===               ===               === -dequeue() x 3--&gt; ===
        v                                                                  ...
        a                                                 null &lt;-front()-- ===
</pre>

<p>
Sample Application:  Printer queues.  When you submit a job to be printed at
a selected printer, your job goes into a queue.  When the printer finishes
printing a job, it dequeues the next job and prints it.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">interface</span> <span style="color: #ce537a; font-weight: bold;">Queue</span> {
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">size</span>();
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">boolean</span> <span style="color: #bc6ec5; font-weight: bold;">isEmpty</span>();
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">enqueue</span>(<span style="color: #ce537a; font-weight: bold;">Object</span> <span style="color: #7590db;">item</span>);
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">Object</span> <span style="color: #bc6ec5; font-weight: bold;">dequeue</span>();
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">Object</span> <span style="color: #bc6ec5; font-weight: bold;">front</span>();
}
</pre>
</div>

<p>
In any reasonable implementation, all these methods run in O(1) time.  A queue
is easily implemented as a singly-linked list with a tail pointer.
</p>
</div>
</div>

<div id="org68fa667" class="outline-2">
<h2 id="org68fa667">DEQUES</h2>
<div class="outline-text-2" id="text-org68fa667">
<p>
A <span class="underline">deque</span> (pronounced "deck") is a Double-Ended QUEue. You can insert and remove
items at both ends. You can easily build a fast deque using a doubly-linked
list. You just have to add removeFront() and removeBack() methods, and deny
applications direct access to listnodes. Obviously, deques are less powerful
than lists whose listnodes are accessible. 
</p>
</div>
<div id="orgd7abd84" class="outline-3">
<h3 id="orgd7abd84">Postscript:  A Faster Hash Code (not examinable)</h3>
<div class="outline-text-3" id="text-orgd7abd84">
<p>
Here's another hash code for Strings, attributed to one P. J. Weinberger, which
has been thoroughly tested and performs well in practice.  It is faster than
the one above, because it relies on bit operations (which are very fast) rather
than the % operator (which is slow by comparison).  You will learn about bit
operations in CS 61C.  Please don't ask me to explain them to you.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">hashCode</span>(<span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">key</span>) {
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">code</span> = <span style="color: #a45bad;">0</span>;

  <span style="color: #4f97d7; font-weight: bold;">for</span> (<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = <span style="color: #a45bad;">0</span>; i &lt; key.<span style="color: #ce537a; font-weight: bold;">length</span>(); i++) {
    code = (code &lt;&lt; <span style="color: #a45bad;">4</span>) + key.charAt(i);
    code = (code &amp; <span style="color: #a45bad;">0x0fffffff</span>) ^ ((code &amp; <span style="color: #a45bad;">0xf0000000</span>) &gt;&gt; <span style="color: #a45bad;">24</span>);
  }

  <span style="color: #4f97d7; font-weight: bold;">return</span> code;
}
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
